Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཁྱོད་ཀྱིས་དྲིན་དུ་གཟོ་བ་དང་། བྱས་པ་དྲན་པར་བྱའོ། །འདི་ནི་བདག་གི་དགེ་བའི་བཤེས་གཉེན་ཏེ།
en: You should be grateful and mindful of that, saying, “This is my spiritual mentor.

source: འདི་ལས་བདག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐོས་སོ། །གང་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་མྱུར་དུ་སླར་མི་ལྡོག་པར་འགྱུར་བ་དང་།
en: I will hear the perfection of wisdom from that one, and having heard it, {Va.239} I will make swift and irreversible progress to unsurpassed, complete enlightenment.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་དང་ཉེ་བར་འགྱུར་བ་དང་།
en: I will approach the tathāgatas, arhats, completely awakened buddhas.

source: དེ་བཞིན་གཤེགས་པ་དང་མི་འབྲལ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བར་འགྱུར་བ་དང་། མི་ཁོམ་པ་རྣམས་སྤངས་པར་འགྱུར་བ་དང་།
en: I will be reborn in the buddhafields, inseparable from the tathāgatas, abandon the unfavorable conditions, and acquire the freedoms and opportunities.” “ ‘

source: དལ་འབྱོར་དང་ལྡན་པར་འགྱུར་རོ། །ཞེས་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཕན་ཡོན་འདི་དག་ཡོངས་སུ་བརྟག་ཅིང་ཆོས་སྨྲ་བའི་དགེ་སློང་ལ་སྟོན་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའི།
en: Noble son, you should consider these opportunities, and perceive that monk who teaches the Dharma as the Teacher.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་འཇིག་རྟེན་གྱི་ཟང་ཟིང་དང་ལྡན་པའི་སེམས་ཀྱིས་ཆོས་སྨྲ་བའི་དགེ་སློང་ལ་བསྙེན་པར་མི་བྱའོ།
en: Noble son, you should not honor a monk who teaches the Dharma with thoughts of mundane material things.

source: །ཁྱོད་ཀྱིས་ཆོས་དོན་དུ་གཉེར་བ་དང་། ཆོས་ལ་གུས་པས་ཆོས་སྨྲ་བའི་དགེ་སློང་གི་རྗེས་སུ་འབྲང་བར་བྱའོ།
en: You should follow a monk who teaches the Dharma with interest in the Dharma and with respect. “ ‘

source: །ཁྱོད་ཀྱིས་བདུད་ཀྱི་ལས་རྣམས་ཀྱང་ཤེས་པར་བྱ་སྟེ།
en: You should also understand the deeds of Māra.

source: རིགས་ཀྱི་བུ་བདུད་སྡིག་ཏོ་ཅན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་གཟུགས་དང་། སྒྲ་དང་དྲི་དང་རོ་དང་རེག་པ་དག་བསྙེན་པ་དང་། བསྟེན་པ་དང་། སྤྱད་པའི་ཕྱིར་ཁྱེར་ཏེ་འོང་བ་དག་ཀྱང་ཡོད་དོ། །དེ་དག་ཀྱང་ཟིལ་གྱིས་མནན་ནས།
en: Noble son, there are even [acolytes of] evil Māra who approach bodhisattva great beings to dissuade them, [insinuating] that the [Teacher] reveres, tends toward, and enjoys sights, sounds, odors, tastes, and tangibles, when they have actually overcome these, and then revered, tended toward, and enjoyed them through skill in means.

source: ཐབས་མཁས་པས་སོར་བསྙེན་བསྟེན་ཡོངས་སུ་སྤྱོད་དོ། །དེ་ལ་ཡང་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཆོས་སྨྲ་བ་ལ་སེམས་མ་དད་པ་མི་བསྐྱེད་པ་འདི་ལྟར་སེམས་བསྐྱེད་དོ། །བདག་ནི་ཐབས་མཁས་པ་དེ་རབ་ཏུ་མི་ཤེས་ཀྱི། འདི་ནི་ཐབས་མཁས་པས་རབ་ཏུ་ཤེས་སོ།
en: In this regard, noble son, you should not lose faith in the one who teaches the Dharma, but think as follows: “I do not understand that skill in means, but this [teacher] does understand with skill in means.

source: །འདི་ནི་སེམས་ཅན་གྱི་ཚུལ་གྱིས་སེམས་ཅན་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ཆོས་འདི་རྣམས་སོ་སོར་བསྙེན་བསྟེན་སྤྱོད་པར་བྱེད་དོ།
en: This [teacher] reveres, tends toward, and enjoys these things in order that beings might acquire the roots of virtuous action, through the disciplining of beings.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་གང་ལ་ཡང་ཆགས་པ་འམ་སྒྲིབ་པ་མེད་དོ།
en: Bodhisattva great beings are without attachment or obscuration in any respect.” “ ‘

source: །དེའི་ཚེ་ཡང་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་ཚུལ་སོ་སོར་བརྟག་པར་བྱའོ།
en: At that time, also, noble son, you should examine the genuine principle of phenomena.

source: །རིགས་ཀྱི་བུ་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་ཚུལ་ཡང་གང་ཞེ་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའོ།
en: Noble son, if you ask what is the genuine principle of phenomena, it is that all phenomena are without affliction and without purification.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: If you ask why, all phenomena are empty of inherent existence.

source: །ཆོས་ཐམས་ཅད་ནི་སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གང་ཟག་མེད་པ་སྟེ།
en: All phenomena are without beings, without life forms, and without individual personalities.

source: སྒྱུ་མ་ལྟ་བུ་རྨི་ལམ་ལྟ་བུ་བྲག་ཆ་ལྟ་བུ་གཟུགས་བརྙན་ལྟ་བུའོ།
en: That is to say, they are like a magical display, like a dream, like an echo, and like a reflection.

source: །རིགས་ཀྱི་བུ་ཁྱོད་དེ་ལྟར་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་ཚུལ་སོ་སོར་རྟོག་ཅིང་ཆོས་སྨྲ་བའི་རྗེས་སུ་འབྲང་ན། རིང་པོ་མི་ཐོགས་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་འབྱུང་བར་འགྱུར་རོ།
en: Noble son, when you examine the genuine principle of phenomena in that manner and follow the teacher of the Dharma, you will before long be emancipated through the perfection of wisdom. “ ‘

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བདུད་ཀྱི་ལས་གཞན་དག་ཀྱང་ཤེས་པར་བྱ་བ་ནི་རིགས་ཀྱི་བུ་གལ་ཏེ་ཆོས་སྨྲ་བ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདོད་པའི་རིགས་ཀྱི་བུ་ལ་གཤེ་ཞིང་མི་ལྟ་ན། དེ་ལ་ཡང་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་སླར་ཀྱལ་བར་མི་བྱའི།
en: Noble son, you should be aware of yet another deed of Māra. Noble son, if a teacher of the Dharma should discourage you, noble son, while you seek the perfection of wisdom, and disregard you, you should not at all, noble son, be averse to that [perfection of wisdom].

source: གཞན་དུ་ན་ཆོས་དོན་དུ་གཉེར་བ་དང་། ཆོས་ལ་གུས་པ་དང་། སེམས་མི་སྐྱོ་བས་ཆོས་སྨྲ་བའི་དགེ་སློང་གི་རྗེས་སུ་འབྲང་བར་བྱའོ།
en: Rather, with a mind intent on the Dharma, that respects the Dharma and is without weariness, you should follow the monk who preaches the Dharma.’ “

source: །དེ་ནས་རྟག་པར་རབ་ཏུ་ངུ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྒྲ་དེ་ལས་གདམས་པ་འདི་ལྟ་བུ་ཐོས་ནས། ཤར་ཕྱོགས་ཀྱི་ཕྱོགས་ག་ལ་བ་དེར་སོང་ངོ་།
en: Then, having heard this admonition from the voice, the bodhisattva great being Sadāprarudita traveled toward the east.

source: །སོང་ནས་རིང་པོ་མ་ལོན་པར་ཡང་དེ་ལ་འདི་སྙམ་དུ་གྱུར་ཏོ། །བདག་གིས་སྒྲ་དེ་ལས་བདག་ཇི་སྲིད་དུ་འགྲོ་དགོས་ཤེས་མ་དྲིས་སོ་སྙམ་ནས།
en: Not long after setting out, he had the following thought: ‘I did not ask that voice how far I should go.’

source: དེ་ས་ཕྱོགས་དེ་ཉིད་དུ་འདུག་སྟེ། ངུ་ཞིང་འབོད་པ་དང་། མྱ་ངན་བྱེད་སྨྲེ་སྔགས་འདོན་ཅིང་འདི་སྙམ་དུ་སེམས་སོ།
en: He stood still in that very place and he wept, cried out, sorrowed, and lamented.

source: །ས་ཕྱོགས་འདི་ཉིད་དུ་ཉིན་ཞག་གཅིག་གམ་གཉིས་སམ། གསུམ་མམ་བཞི་འམ་ལྔ་འམ་དྲུག་གམ་ཉིན་ཞག་བདུན་འདས་པར་བྱས་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཐོས་ཀྱི་བར་དུ་ལུས་ངལ་བའི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེད།
en: He then had this thought: ‘Having passed one or two or three or four or five or six or seven days in this very place, until I hear the perfection of wisdom I will not pay attention to the weariness of my physical body.

source: རྨུགས་པ་དང་གཉིད་ཀྱི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེད།
en: I will not pay attention to dullness and sleep.

source: བཟའ་བའི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེད།
en: I will not pay attention to food.

source: བཏུང་བའི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེད།
en: I will not pay attention to drink.

source: མཚན་མོ་ཡིད་ལ་བྱེད་པ་མི་སྐྱེད།
en: I will not pay attention to night.

source: ཉིན་པར་གྱི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེད།
en: I will not pay attention to day.

source: གྲང་བའི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེད་དོ་སྙམ་དུ་སེམས་སོ།
en: I will not pay attention to cold, and I will not pay attention to heat.’

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན་མི་ཞིག་བུ་གཅིག་པ་ཞིག་དུས་ལས་འདས་ཏེ་སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་ཆེན་པོ་དང་ལྡན་པར་གྱུར་ཏེ། དེ་བུའི་མྱ་ངན་གྱིས་བུའི་མྱ་ངན་ལས་གཞན་པའི་ཡིད་ལ་བྱེད་པ་མི་འབྱུང་བ་དེ་བཞིན་དུ་རབ་འབྱོར་རྟག་པར་རབ་ཏུ་ངུ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་དེའི་ཚེ། ནམ་ཞིག་བདག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཐོས་པར་འགྱུར་སྙམ་པ་ལས་གཞན་པའི་ཡིད་ལ་བྱེད་པ་མི་འབྱུང་ངོ་།
en: Subhūti, just as a man whose only child had passed away would experience suffering and great unhappiness, paying attention to nothing except the sorrow of [losing] his child due to the sorrow for his child, in the same way, Subhūti, the bodhisattva great being Sadāprarudita {Va.240} at that time did not pay attention to anything except the thought, ‘When shall I hear that perfection of wisdom?’ “

source: །རབ་འབྱོར་དེ་ནས་རྟག་པར་རབ་ཏུ་ངུ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་ཕོངས་ཤིང་འདུག་པའི་མདུན་དུ། དེ་བཞིན་གཤེགས་པའི་སྐུ་བྱུང་ནས། རིགས་ཀྱི་བུ་ཁྱོད་དེ་སྐད་སྨྲ་བ་ལེགས་སོ། །ལེགས་སོ་ཞེས།
en: Then, Subhūti, while the bodhisattva great being Sadāprarudita stood there, pining away in that manner, an image of the Tathāgata appeared before him and gave his approval, saying, ‘Noble son, you have spoken well!

source: ལེགས་པ་བྱིན་ཏེ།
en: Excellent!

source: སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཇི་ལྟར་ད་ལྟར་ཁྱེད་ཚོལ་བ་དེ་བཞིན་དུ་བཙལ་ཏོ།
en: The tathāgatas, arhats, completely awakened buddhas of the past also searched for the perfection of wisdom in the manner in which you now search for it.

source: །དེ་བས་ན་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བརྩོན་འགྲུས་དེ་ཉིད་དང་། སྤྲོ་བ་དེ་ཉིད་དང་། དོན་དུ་གཉེར་བ་དེ་ཉིད་དང་། མོས་པ་དེ་ཉིད་ཀྱིས་རྒྱུན་ཆགས་པར་ཤར་ཕྱོགས་སུ་སོང་ཤིག་དང་།
en: Therefore, noble child, you should go continuously toward the east, with that same perseverance, that same enthusiasm, that same intent, and that same resolve.

source: འདི་ནས་དཔག་ཚད་ལྔ་བརྒྱ་ན། སྤོས་ཅན་ཞེས་བྱ་བའི་གྲོང་ཁྱེར་ཞིག་ཡོད་དེ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ། ར་བ་བདུན་རིམ་གྱིས་བསྐོར་བ། འོབས་བདུན་རིམ་གྱིས་བསྐོར་བ། ཤིང་ཏ་ལའི་ཕྲེང་བ་བདུན་གྱིས་བསྐོར་བ། ཆུར་དཔག་ཚད་བཅུ་གཉིས། ཞེང་དུ་དཔག་ཚད་བཅུ་གཉིས།
en: Five hundred yojanas from here, there is a city called Gandhavati, constructed of the seven precious materials, twelve yojanas in length and twelve yojanas in breadth, surrounded in succession by seven perimeter walls, surrounded in succession by seven moats, and surrounded by seven rows of palm trees.

source: འབྱོར་ཅིང་དར་བ། བདེ་ཞིང་སྐྱིད་པ། ཉམས་དགའ་བ། མི་མང་པོས་གང་བ།
en: It is prosperous, flourishing, secure, happy, and joyful, filled with a large population.

source: སྲང་གི་ཚོང་ཁང་རི་མོ་ལ་བྲིས་པ་ལྟ་བུ་མཉམ་པ་ལྔ་བརྒྱ་ཡོད་པ། ཁྱོགས་དང་བཞོན་པ་མི་དོག་པར་འགྲོ་བའི་ཟམ་པ་དང་བཅས་པ།
en: It has five hundred roadside stalls, evenly spaced, as if drawn in a painting, with bridges offering access to palanquins, vehicles, and pedestrians.

source: གྲོང་ཁྱེར་དེའི་ཁོ་ར་ཁོར་ཡུག་གི་རྩིག་པ་ཡང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ།
en: Even the walls surrounding the perimeter of that city are fashioned of the seven precious materials, and they are proportionate and tall.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རྩིག་པ་དེ་དག་གི་རིབ་མ་ཡང་འཛམ་བུ་ན་དའི་གསེར་ལས་བྱས་པ། ཚད་དང་ལྡན་ཞིང་འཕང་མཐོ་བ།
en: Even the ramparts of the walls, fashioned of the seven precious materials, are made from the gold of the river Jambu.

source: རིབ་མ་དེ་དག་རེ་རེ་ལས་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་། འབྲས་བུ་སྣ་ཚོགས་དང་ལྡན་པ་རྣམས་སྐྱེས་ཏེ།
en: From each of these ramparts there also grow trees fashioned of the seven precious materials, with diverse fruits.

source: འབྲས་བུ་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་རིན་པོ་ཆེ་ལས་བྱས་པའི་སྲད་བུས་སྦྲེལ་བའི་ཤིང་གཞན་དག་དང་ལྡན་པ་ཤ་སྟག་གོ །
en: Between all these fruit [trees] there are threads also fashioned of the seven precious materials that connect them exclusively with the other trees.

source: གྲོང་ཁྱེར་དེ་ཐམས་ཅད་ཀྱང་གསེར་གྱི་དྲིལ་བུའི་དྲ་བས་གཡོགས་ཏེ། གསེར་གྱི་དྲིལ་བུའི་དྲ་བ་དེ་དག་རླུང་གིས་བསྐྱོད་པའི་སྒྲ་སྙན་ཅིང་ཡིད་དུ་འོང་བ་ཆགས་པར་འགྱུར་བ་དག་འབྱུང་སྟེ།
en: The entire city is covered with a network of golden bells, and that network of golden bells emits sweet, pleasant, and attractive tinkling when shaken by the wind.

source: དཔེར་ན་ཡན་ལག་ལྔ་དང་ལྡན་པའི་རྔ་རོལ་མོ་མཁན་མཁས་པ་རྣམས། ཚོགས་པས་བརྡུངས་པའི་སྒྲ་སྙན་ཅིང་ཡིད་དུ་འོང་ལ། ཆགས་པར་འགྱུར་བའི་སྒྲ་འབྱུང་བ་དེ་བཞིན་དུ། དྲིལ་བུའི་དྲ་བ་དེ་དག་རླུང་གིས་བསྐྱོད་པའི་སྒྲ་སྙན་ཅིང་ཡིད་དུ་འོང་བ་ཆགས་པར་འགྱུར་བ་འབྱུང་ངོ་།
en: Just as a group of skilled [celestial] percussionists with their five sorts of instruments produces sounds that are sweet, pleasant, and attractive, in the same way that network of bells emits a sweet, pleasant, and attractive tinkling when shaken by the wind.

source: །སེམས་ཅན་དེ་དག་ཀྱང་སྒྲ་དེ་དག་གིས་རྩེ་ཞིང་དགའ་བ་དང་ཡོངས་སུ་སྤྱོད་པར་བྱེད་དོ།
en: These tinkling sounds also inspire beings to play, delight, and enjoy themselves.

source: །གྲོང་ཁྱེར་སྤོས་ཅན་དེའི་ཁོ་ར་ཁོར་ཡུག་གི་འོབས་ཀྱང་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་ཡོངས་སུ་གང་ཞིང་རྒྱུན་དུ་འབབ་སྟེ། ཧ་ཅང་ཡང་མི་གྲང་ཧ་ཅང་ཡང་མི་དྲོ་བའི་ཆུ་དེ་ལ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་གྲུ།
en: Even the moats that surround the city of Gandhavati are filled with constantly flowing water, endowed with the eight pure qualities, and on that water, which is neither too cold not too hot, are boats fashioned of the seven precious materials.

source: སེམས་ཅན་དེ་དག་གི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བ། དེ་དག་ཏུ་སེམས་ཅན་དེ་དག་ཞུགས་ནས། རྩེ་ཞིང་དགའ་བ་དང་། ཡོངས་སུ་སྤྱོད་པ་བྱེད་དོ།
en: These have originated from the maturation of the past actions of those beings [inhabiting the city], and the beings on board play, rejoice, and enjoy themselves.

source: །ཆུ་དེ་དག་ཐམས་ཅད་ཀྱང་ཨུཏྤ་ལ་དང་། པད་མ་དང་ཀུ་མུ་ད་དང་། པུན་དཱ་རི་ཀས་ཁེབས་པ། གཞན་ཡང་མེ་ཏོག་རིགས་ཆེ་ཞིང་བསུང་ཞིམ་པ་དག་གིས་ཡོངས་སུ་ཁེབས་ཏེ།
en: All these waterways are also covered with blue lotuses, day lotuses, night lotuses, and white lotuses, and they are also covered with most fragrant species of flowers.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། མེ་ཏོག་གི་རིགས་གང་དང་གང་ཡོད་པ་དེ་དག་ཐམས་ཅད་སྤོས་ཅན་གྱི་གྲོང་ཁྱེར་ན་མེད་པ་གཅིག་ཀྱང་མེད་དོ།
en: Indeed, there is no species of flower at all in the world systems of the great trichiliocosm that is not found in the city of Gandhavati.

source: །གྲོང་ཁྱེར་དེའི་ཁོ་ར་ཁོར་ཡུག་ན། སྐྱེད་མོས་ཚལ་ལྔ་བརྒྱ་ཡོད་དེ། དེ་དག་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ། བཟང་ཞིང་བལྟ་ན་སྡུག་པ་ཤ་སྟག་གོ །
en: All around that city there are five hundred parks, all of them fashioned of the seven precious materials, beautiful and absolutely delightful to behold.

source: སྐྱེད་མོས་ཚལ་དེ་རེ་རེ་ན་ཡང་རྒྱང་གྲགས་གཅིག་པའི་མཚོ་ལྔ་བརྒྱ་ཡོད་དེ། མཚོ་དེ་དག་ཐམས་ཅད་ན་ཡང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཨུཏྤ་ལ་དང་། པད་མ་དང་ཀུ་མུ་ད་དང་། པུན་དཱ་རི་ཀ་མཛེས་ཤིང་བལྟ་ན་སྡུག་པ་རྣམས་ཀྱིས་ཁེབས་པར་འཁོད་དོ། །ཨུཏྤ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པུན་དཱ་རི་ཀ་དེ་དག་ཐམས་ཅད་ཀྱང་ཆུ་ཞེང་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་ཤ་སྟག་སྟེ། མཐིང་ཀ་ལ་ཁ་དོག་མཐིང་ཁར་འདུག་པ། མཐིང་ཁ་འདྲ་ཞིང་མཐིང་ཁར་སྣང་བ། སེར་པོ་ལ་ཁ་དོག་སེར་པོ།
en: In each of these parks there are five hundred lakes measuring one earshot across, and each of these lakes is covered with blue lotuses, day lotuses, night lotuses, and white lotuses, fashioned of the seven precious materials, beautiful and delightful to behold.

source: སེར་པོ་འདྲ་ཞིང་སེར་པོར་སྣང་བ། དམར་པོ་ལ་ཁ་དོག་དམར་པོ། དམར་པོ་འདྲ་ཞིང་དམར་པོར་སྣང་བ། དཀར་པོ་ལ་ཁ་དོག་དཀར་པོ། །དཀར་པོ་འདྲ་ཞིང་དཀར་པོར་སྣང་བ་ཤ་སྟག་གོ །
en: Every one of those blue lotuses, day lotuses, night lotuses, and white lotuses have the diameter of a cartwheel—the blue ones are all azure in color, look azure and appear as azure; the yellow ones are all golden in color, look yellow and appear as yellow; the red ones are all red in color, look red and appear as red; and the white ones are all white in color, look white and appear as white.

source: མཚོ་དེ་དག་ཐམས་ཅད་ན་བྱ་ངང་མོ་དང་། ཀ་རན་ད་བ་དང་། ཁྲུང་ཁྲུང་དང་། ས་ར་ས་དང་། ངུར་པའི་སྒྲས་ཁྱབ་པར་སྒྲོགས་སོ།
en: All these lakes are filled with the sound of swans, {Va.241} ducks, cranes, Indian cranes, and shelducks.

source: །སྐྱེད་མོས་ཚལ་དེ་དག་ཐམས་ཅད་ཀྱང་བདག་གི་བྱ་བ་མེད་པ།
en: All of these parks are without private ownership or appropriation.

source: ཡོངས་སུ་གཟུང་བ་མེད་པ། སེམས་ཅན་དེ་དག་ཉིད་ཀྱི་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བ་སྟེ།
en: They have originated from the maturation of the past actions of those same beings.

source: འདི་ལྟར་ཡུན་རིང་པོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པ་དང་། ཆོས་ཟབ་མོ་ལ་རབ་ཏུ་མོས་པའི་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བ་ཤ་སྟག་གོ །
en: That is to say, they have emerged entirely from the maturation of their belief in the profound Dharma, and from their having practiced the perfection of wisdom over a long time. “ ‘

source: རིགས་ཀྱི་བུ་སྤོས་ཅན་གྱི་གྲོང་ཁྱེར་གྱི་ལམ་སྲང་གི་མདོའི་དབུས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པའི་ཁྱིམ་ཁོ་ར་ཁོར་ཡུག་ཏུ་དཔག་ཚད་གཅིག་ཡོད་པ། རིན་པོ་ཆེ་བདུན་ལས་བྱས་པ།
en: Noble son, at the center of the crossroads in that city of Gandhavati is situated the house of the bodhisattva great being Dharmodgata, fashioned of the seven precious materials, and one yojana in circumference.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་མཛེས་པར་བྱས་པ། བལྟ་ན་སྡུག་པ། ར་བ་བདུན་དང་། ཤིང་ཏ་ལའི་འཕྲེང་བ་བདུན་གྱིས་བསྐོར་བའོ།
en: It is adorned with various gemstones, delightful to behold, and surrounded by seven walls and seven rows of palm trees.

source: །ཁྱིམ་དེ་ན་ཁྱིམ་གྱི་ལོངས་སྤྱོད་དུ་སྐྱེད་མོས་ཚལ་བཞི་ཡོད་དེ། རྟག་པར་རབ་ཏུ་དགའ་བ་ཞེས་བྱ་བའི་སྐྱེད་མོས་ཚལ་དང་། མྱ་ངན་མེད་པ་ཞེས་བྱ་བ་དང་། མྱ་ངན་དང་བྲལ་བ་ཞེས་བྱ་བ་དང་། མེ་ཏོག་མཛེས་པ་ཞེས་བྱ་བའི་སྐྱེད་མོས་ཚལ་ལོ།
en: Within the grounds of that mansion there are four gardens for the enjoyment of the household, namely the garden called Nityapramudita, the garden called Aśoka, the garden called Śokavigata, and the garden called Puṣpacitra.

source: །སྐྱེད་མོས་ཚལ་དེ་དག་རེ་རེ་ན་ཡང་མཚེའུ་བརྒྱད་བརྒྱད་ཡོད་དེ། བཟང་མོ་ཞེས་བྱ་བ་དང་། བཟང་མོའི་མཆོག་ཅེས་བྱ་བ་དང་། དགའ་བ་ཞེས་བྱ་བ་དང་། དགའ་བའི་མཆོག་ཅེས་བྱ་བ་དང་། བདེ་བ་ཞེས་བྱ་བ་དང་།
en: Within each of these gardens there are also eight ponds, called Bhadrā, Bhadrottamā, Nandā, Nandottamā, Kṣamā, Kṣamotta, Niyatā, and Avivahā.

source: བདེ་བ་ཅན་ཞེས་བྱ་བ་དང་། ངེས་པ་ཞེས་བྱ་བ་དང་། རྣམ་པར་མི་འབབ་པ་ཞེས་བྱ་བ་སྟེ། མཚེའུ་དེ་རྣམས་ཀྱི་ངོས་གཅིག་ནི་གསེར་ལས་བྱས། ངོས་གཉིས་པ་ནི་དངུལ་ལས་བྱས།
en: The first side of each pond is fashioned of gold, the second side is fashioned of silver, the third side is fashioned of beryl, and the fourth side is fashioned of crystal.

source: ངོས་གསུམ་པ་ནི་བཻ་ཌཱུརྱ་ལས་བྱས། ངོས་བཞི་པ་ནི་ཤེལ་ལས་བྱས། ནང་གི་གཞི་ནི་ཀར་ཀེ་ཏ་ན་ལས་བྱས་ཤིང་གཞི་གསེར་གྱི་བྱེ་མ་བཀྲམ་པའོ།
en: The base of [each pond] is fashioned of quartz, and the base is strewn with golden sand.

source: །མཚེའུ་དེ་རེ་རེ་ལ་ཡང་འབབ་སྟེགས་ཁྲི་འཕང་ཅན་བརྒྱད་བརྒྱད་ཡོད་དེ། འབབ་སྟེགས་ཀྱི་ངོས་ཀུན་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་ཅིང་།
en: Each pond has eight sets of steps, the height of a throne, and the surfaces of all the steps are embellished with variegated gemstones.

source: འབབ་སྟེགས་ཀྱི་བར་ཐམས་ཅད་ནས་འཛམ་བུ་ན་དའི་གསེར་གྱི་ཆུ་ཤིང་དག་སྐྱེས་སོ། །མཚེའུ་དེ་དག་ཐམས་ཅད་ན་མེ་ཏོག་ཨུཏྤ་ལ་དང་།
en: From the gaps between all the steps grow plantain trees, fashioned of gold from the river Jambu.

source: པད་མ་དང་། ཀུ་མུ་ད་དང་། པུན་དཱ་རི་ཀ་སྣ་ཚོགས་ཀྱིས་ཁེབས་ཤིང་། བྱ་ངང་མོ་དང་། ས་ར་ས་དང་།
en: All these ponds are covered with various kinds of blue lotuses, day lotuses, night lotuses, and white lotus flowers, and they resonate with the sound of swans, Indian cranes, and shelducks.

source: ངུར་པའི་སྒྲ་སྒྲོགས་སོ། །མཚེའུ་དེ་དག་གི་ཁོ་ར་ཁོར་ཡུག་ན་མེ་ཏོག་གི་ཤིང་རྣམ་པ་སྣ་ཚོགས་སྐྱེའོ། །མེ་ཏོག་གི་ཤིང་དེ་དག་རླུང་གིས་བཏབ་པའི་མེ་ཏོག་རྣམས་ཀྱང་མཚེའུ་ནང་དུ་ལྷགས་སོ།
en: All around these ponds grow various flowering trees, and when these flowering trees are stirred by the wind, their flowers drop into the ponds.

source: །མཚེའུ་དེ་དག་ཐམས་ཅད་ཀྱི་ཆུ་ཡང་ཙན་དན་གྱི་བསུང་ཅན་ལ་ཁ་དོག་དང་དྲི་དང་། རོ་དང་། རེག་པ་ཕུན་སུམ་ཚོགས་པའོ།
en: The water in all these ponds has the scent, color, taste, and feel of sandalwood.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པའི་རྩེ་བའི་ས་ཡོད་དེ།
en: In this mansion there is the residence where the bodhisattva great being Dharmodgata plays.

source: དེ་འཁོར་དང་བཅས་པ། བུད་མེད་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་དང་ལྷན་ཅིག །འདོད་པའི་ཡོན་ཏན་ལྔ་དང་ལྡན་ཞིང་འབྱོར་པས། དེ་ན་རྩེ་དགའ་ཡོངས་སུ་སྤྱོད་དོ།
en: With a retinue including sixty-eight thousand women, he is endowed with the five desirable attributes of the senses, and there he plays, delights, and amuses himself.

source: །གྲོང་ཁྱེར་དེ་ན་གནས་པའི་སེམས་ཅན་སྐྱེས་པ་འམ། བུད་མེད་གང་ཡིན་པ་དེ་དག་ཀྱང་རྟག་པར་རབ་ཏུ་དགའ་ཞིང་སྐྱེད་མོས་ཚལ་དང་། མཚེའུ་རྣམས་སུ་འདོད་པའི་ཡོན་ཏན་ལྔ་དང་ལྡན་ཞིང་འབྱོར་བས་རྩེ་དགའ་ཡོངས་སུ་སྤྱོད་དོ།
en: The beings dwelling in that city, men and women, are also always joyful, and they play, delight, and amuse themselves since, in these parks and lakes, they are endowed with the five desirable attributes of the senses. “ ‘

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེ་ཡང་། འཁོར་དང་བཅས་པར་ལྷན་ཅིག་རྩེ་ཞིང་དགའ་བ་ཡོངས་སུ་སྤྱད་ནས། དེའི་འོག་ཏུ་དུས་གསུམ་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཆད་དོ།
en: The bodhisattva great being Dharmodgata, however, after playing, delighting, and amusing himself with his retinue, thereafter always explains the perfection of wisdom.

source: །གྲོང་ཁྱེར་སྤོས་ཅན་དེ་ན་འཁོད་པའི་སེམས་ཅན་གང་ཡིན་པ་དེ་དག་ཀྱང་གྲོང་ཁྱེར་གྱི་ལམ་མདོའི་དབུས་སུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པའི་ཆོས་ཀྱི་ཁྲི་འཛུགས་ཏེ།
en: The citizens of that city, Gandhavati, constructed a teaching throne for the bodhisattva great being Dharmogata at the center of the city crossroads.

source: རྐང་པ་གསེར་ལས་བྱས་པ་འམ། དངུལ་ལས་བྱས་པ་འམ། བཻ་ཌཱུརྱ་ལས་བྱས་པ་འམ། ཤེལ་ལས་བྱས་པའི་སྟེང་། ཤིང་བལ་གྱི་སྟན་ནམ།
en: Its legs are fashioned of gold, fashioned of silver, fashioned of beryl, and fashioned of crystal, and upon it is spread a mat of tree cotton, or a mat of wool, or a mat of padding, or a mat of silk.

source: འགོ་ལི་ཀའི་སྟན་ནམ། ཁོང་ཚང་ཅན་གྱི་སྟན་ནམ། ཀ་ཤི་ཀའི་གོས་བཏིང་བ། འཕང་དུ་རྒྱང་གྲགས་ཕྱེད་ཙམ་ཡོད་པ། སྟེང་གི་བར་སྣང་ལས་ཀྱང་མུ་ཏིག་གིས་བརྒྱན་པའི་བླ་རེ་བྲེས་པས།
en: In the air above, about the height of half an earshot, there is a canopy, adorned with pearls.

source: ཕྱོགས་དེ་ཁོ་ར་ཁོར་ཡུག་ཏུ་ཡང་། མེ་ཏོག་ཁ་དོག་རྣམ་པ་ལྔས་འཐོར། མངོན་པར་འཐོར། རབ་ཏུ་མངོན་པར་འཐོར་རོ། །བདུག་སྤོས་བསུང་ཞིམ་པོ་སྣ་ཚོགས་ཀྱིས་ཀྱང་ས་ཕྱོགས་དེ་བདུག་པར་བྱེད་དོ།
en: All around that [throne], flowers of five colors are sprinkled, strewn, and showered, and the area is also scented with diverse sweet fragrances.

source: །དེ་འདི་ལྟར་ཆོས་ལ་གུས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་གང་ལ་འདུག་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཆོས་འཆད་པ་ལ།
en: Respectful of the Dharma in this manner, the bodhisattva great being Dharmodgata is seated upon it, explaining the Dharma of the perfection of wisdom. {

source: བསུང་ཅན་ན་འཁོད་པའི་སེམས་ཅན་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་དེ་ལྟ་བུའི་ཆོས་ལ་གུས་པའི་ཚུལ་གྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉན་པ་ནི་སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་པོ། སྲོག་ཆགས་སྟོང་ཕྲག་མང་པོ།
en: Va.242} The beings who are present within range of that fragrance, respectful of this Dharma that the bodhisattva great being Dharmodgata has, listen to this perfection of wisdom.

source: །སྲོག་ཆགས་བརྒྱ་སྟོང་ཕྲག་མང་པོ་རྣམས་ལྷགས་པར་གྱུར་ཏེ། མི་དང་ལྷ་རྣམས་གང་ཉན་པ་དེ་དག་ལས་ཁ་ཅིག་ནི་ཀློག་སློབ། ཁ་ཅིག་ནི་ཁ་ཏོན་སློབ། ཁ་ཅིག་ནི་ཡོངས་སུ་ཆུད་པར་བྱེད། ཁ་ཅིག་ནི་འཛིན།
en: Many hundreds of living creatures, many thousands of living creatures, many hundred thousands of living creatures assemble there, and among those human beings and gods who assemble there to listen there are some who train in reading it, some who train in reciting it, some who comprehend it, some who grasp it, some who retain it, some who repeat it, some who question it, and some who follow it, focusing their attention correctly on it.

source: ཁ་ཅིག་ནི་འཆང་། ཁ་ཅིག་ནི་ཟློས། ཁ་ཅིག་ནི་འདྲི། ཁ་ཅིག་ནི་ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པའི་རྗེས་སུ་འགྲོའོ། །སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་ལྟུང་བའི་ཆོས་ཅན་མ་ཡིན་ལ།
en: None of these beings have attributes that would incline them to lapse.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཤ་སྟག་གོ །
en: Indeed, they all exclusively make irreversible progress toward unsurpassed, complete enlightenment.

source: རིགས་ཀྱི་བུ་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེའི་དྲུང་དུ་སོང་ཤིག་དང་།
en: Noble son, you should approach that bodhisattva great being Dharmodgata!

source: དེ་ལས་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐོས་པར་འགྱུར་རོ།
en: From him you shall hear the perfection of wisdom.

source: །དེ་ནི་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱི་ཡུན་རིང་པོའི་དགེ་བའི་བཤེས་གཉེན་སྟོན་པའོ།
en: For a long time, noble son, he will be your spiritual mentor, your teacher.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྐུལ་མ་འདེབས་པ། གཟེང་བསྟོད་པ་རབ་ཏུ་སྤྲོ་བར་བྱེད་པའོ།
en: He will encourage, praise, and make you enthusiastic to [attain] unsurpassed, complete enlightenment.
